#include "mainwindow.h"
#include <QApplication>
#include <QTextCodec>
#include <QSplashScreen>


// Доробити:
// -2. Під час як працює таймер, обнулення очок відбувається при дотику на назву команди.
// -1. І хотілося б, щоб було після 10 секунд якийсь сигнал, мовляв час закінчився.
// 0. Жовтий пошук. Тобто в комбобоксі питання, виділяти запит жовтим кольором. Наполовину готово.
// 1. Автоматичне оновлення додатку.
// 2. Дроп картинок на сцену, які встановлюються на айтем картинки (Item_LineTitlePixmap).
// 4. Можна зробити Cntrl+Z для всієї сцени, або для всього додатку.
// 6. Доробити гарячі клавіші з (&). І подивитися щоб вони з'являлися при запуску. Тому що зараз, після
// запуску, гарячі клавіші не підкреслюються. Тільки після натискання Alt з'являються підкреслення.
// 7. Баг - якщо збільшити шрифт заголовку дуже багато, так що сховається питання, тоді автоматичний підбір шрифту
// буде працювати не коректно, точніше буде рекурсія. В майбутньому можна виправити, подібна ситуація малоймовірна.

int main(int argc, char *argv[])
{
    QApplication a(argc, argv);
    MainWindow win;

    win.setGeometry(QStyle::alignedRect(Qt::LeftToRight,Qt::AlignCenter,win.size(),
                                        qApp->desktop()->availableGeometry()));
//        win.move(560,105);  // після видалити
    win.show();
    return a.exec();
}

